tests/staf-tests/functional-tests/shared/data/dsml/suites/03dsmlerrsuite/data/compare_emptydn.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 534
SOAPAction: batchRequest

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
<batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core"
   requestID="[dn] attribute of [compareRequest] element is empty"
   >
<compareRequest dn="">
<assertion name="sn">
<value>Bergin</value>
</assertion>
</compareRequest>
</batchRequest>
</soap-env:Body>
</soap-env:Envelope>
